using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace ServerProject.Models
{
    public class DB
    {


        public static List<User> Users { get; set; } = new List<User>()
        {
            new User(){Id="226333444",Name="a",Mail="a@gmail.com",Password="1"},
            new User(){Id="222333444",Name="Moshe Kohen",Mail="a@gmail.com",Password="1111"},
            new User(){Id="111222333",Name="Rivka Levi",Mail="b@gmail.com",Password="2222"},
            new User(){Id="333444555",Name="Rachel Kohen",Mail="c@gmail.com",Password="3333"},
            new User(){Id="444555666",Name="Tamar Kohen",Mail="d@gmail.com",Password="4444"},
            new User(){Id="555666777",Name="Sara Kohen",Mail="e@gmail.com",Password="5555"},
        };

        public static List<Recipe> Recipes { get; set; } = new List<Recipe>()
        {
            new Recipe()
            {   Code=1,
                Name="עוגת גבינה פקאן עם קרמל",
                Ingreadients=new List<string>(new string[]{"200 גרם ביסקויטים","75 גרם חמאה מומסת","2 כפות סוכר חום","1/2 כפית קינמון (אןפציונלי)","250 גרם גבינת שמנת.","250 גרם גבינה לבנה 9%.","4 ביצים בטמפרטורת החדר.","1 גביע שמנת חמוצה.","1 כוס סוכר חום בהיר","1 כפית תמצית וניל."}),
                Image="../../assets/Pecan-caramel-and-apple-cheesecake.jpg",
                Introductions=new List<string>(new string[]{ "טוחנים את הביסקויטום במעבד מזון למרקם חולי","מוסיפים חמאה מומסתת סוכר וקינמון ומערבבים עד לאיחוד.","משטחים בתבנית האפיה ומהדקים היטב לבסיס ולדפנות.","אופים כ-10 דקות עד להזהבה. מוציאים ומצננים."}),
                Level=3,
                CategoryCode=1,
                MinutesToMake=105,
                UserCode="1"},
            new Recipe()
            {
                Code=2,
                Name="עוגת גבינה ופרות יער",
                Image="../../assets/Cheesecake-with-Berry-jelly-939x626.jpg",
                Level=5,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=1,
                MinutesToMake=120,
                UserCode="1"
            },
            new Recipe()
            {
                Code=3,
                Name="קרמבו מוקה",
                Image="../../assets/moccha_krembo4s.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=4,
                MinutesToMake=50,
                UserCode="1"
            },
            new Recipe()
            {
                Code=5,
                Name="קינוח שכבות קרם תות וניל שוקולד",
                Image="../../assets/__DSC_0014-עותק.jpg",
                Level=4,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=4,
                MinutesToMake=40,
                UserCode="1"
            },
            new Recipe()
            {
                Code=4,
                Name="קינוח קדאיף וקרם גבינה",
                Image="../../assets/__DSC_0031-עותק.jpg",
                Level=4,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=4,
                MinutesToMake=75,
                UserCode="1"
            },
            new Recipe()
            {
                Code=6,
                Name="פרוזן יוגורט ביתי טעים",
                Image="../../assets/frozen.jpg",
                Level=2,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=4,
                MinutesToMake=25,
                UserCode="1"
            },
            new Recipe()
            {
                Code=7,
                Name="פרפה חלבה- מוס חלבה",
                Image="../../assets/chalva.jpg",
                Level=2,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=4,
                MinutesToMake=45,
                UserCode="1"
            },
            new Recipe()
            {
                Code=8,
                Name="גלידת בננה",
                Image="../../assets/banana-ice.jpg",
                Level=1,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=4,
                MinutesToMake=15,
                UserCode="1"
            },
            new Recipe()
            {
                Code=9,
                Name="קינוח גבינה וריבת חלב",
                Image="../../assets/milkjum.jpg",
                Level=2,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=4,
                MinutesToMake=30,
                UserCode="1"
            },
            new Recipe()
            {
                Code=10,
                Name="קי-ליים פאי קלאסי",
                Image="../../assets/image_0(9).jpeg",
                Level=2,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=1,
                MinutesToMake=40,
                UserCode="1"
            },
            new Recipe()
            {
                Code=11,
                Name="קינוח גלי תותים",
                Image="../../assets/strawberry.jpg",
                Level=2,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=4,
                MinutesToMake=40,
                UserCode="1"
            },
            new Recipe()
            {
                Code=12,
                Name="עוגת קטיפה אדומה",
                Image="../../assets/Red-velvet-cake.jpg",
                Level=5,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=1,
                MinutesToMake=135,
                UserCode="1"
            },
            new Recipe()
            {
                Code=13,
                Name="עוגת זברה וניל שוקולד",
                Image="../../assets/cold-zebra-cake.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=1,
                MinutesToMake=50,
                UserCode="1"
            },
            new Recipe()
            {
                Code=14,
                Name="עוגת גבינה וקפה",
                Image="../../assets/cheese-coffee.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=1,
                MinutesToMake=50,
                UserCode="1"
            },
            new Recipe()
            {
                Code=15,
                Name="עוגת קראמבל גבינת שמנת מפנקת",
                Image="../../assets/Cheese-crumble-dessert.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "2 ביצים מפרדות.","1/3 כוס סוכר.","1/2 כוס קמח.","1 כפית אבקת אפיה.","2 כפות שמן.","1 כפית תמצית וניל.","קורט מלח.","750 גרם גבינה לבנה.",
                    "5 ביצים מופרדות.","1 גביע גבינת שמנת.","1 גביע שמנת חמוצה.","1 כוס סוכר.","4 כפות קורנפלור.","1 חבילת אינסטנט פודינג וניל."}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=1,
                MinutesToMake=50,
                UserCode="1"
            },
            new Recipe()
            {
                Code=16,
                Name="מרק עגבניות קלאסי",
                Image="../../assets/tomato-soup.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "4 כפות שמן זית","1 בצל גדול קצוץ","3 שיני שום כתושות","600 גרם פטריות.","300 גרם ערמונים","1 לי טר מים או מרק ירקות","250 מל שמנת לבישול","1 כפית מלח"}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=5,
                MinutesToMake=20,
                UserCode="1"
            },
            new Recipe()
            {
                Code=17,
                Name="מרק בטטה ושמיר",
                Image="../../assets/red-lentil-soup.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "4 כפות שמן זית","1 בצל גדול קצוץ","3 שיני שום כתושות","600 גרם פטריות.","300 גרם ערמונים","1 לי טר מים או מרק ירקות","250 מל שמנת לבישול","1 כפית מלח"}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=5,
                MinutesToMake=25,
                UserCode="1"
            },
            new Recipe()
            {
                Code=18,
                Name="מרק עוף ואטריות",
                Image="../../assets/chicken-soup.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "4 כפות שמן זית","1 בצל גדול קצוץ","3 שיני שום כתושות","600 גרם פטריות.","300 גרם ערמונים","1 לי טר מים או מרק ירקות","250 מל שמנת לבישול","1 כפית מלח"}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=5,
                MinutesToMake=15,
                UserCode="1"
            },
            new Recipe()
            {
                Code=19,
                Name="קערת לחם למרק",
                Image="../../assets/bread-bowl.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "4 כפות שמן זית","1 בצל גדול קצוץ","3 שיני שום כתושות","600 גרם פטריות.","300 גרם ערמונים","1 לי טר מים או מרק ירקות","250 מל שמנת לבישול","1 כפית מלח"}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=5,
                MinutesToMake=45,
                UserCode="1"
            },
            new Recipe()
            {
                Code=20,
                Name="מרק אפונה לחורף",
                Image="../../assets/edamame-pea-soup-939x626.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "4 כפות שמן זית","1 בצל גדול קצוץ","3 שיני שום כתושות","600 גרם פטריות.","300 גרם ערמונים","1 לי טר מים או מרק ירקות","250 מל שמנת לבישול","1 כפית מלח"}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=5,
                MinutesToMake=35,
                UserCode="1"
            },
            new Recipe()
            {
                Code=21,
                Name="מרק פטריות מיוחד עם ערמונים",
                Image="../../assets/Mushroom.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "4 כפות שמן זית","1 בצל גדול קצוץ","3 שיני שום כתושות","600 גרם פטריות.","300 גרם ערמונים","1 לי טר מים או מרק ירקות","250 מל שמנת לבישול","1 כפית מלח"}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=5,
                MinutesToMake=45,
                UserCode="1"
            },
            new Recipe()
            {
                Code=22,
                Name="סלומון בחצילים",
                Image="../../assets/sal.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "4 כפות שמן זית","1 בצל גדול קצוץ","3 שיני שום כתושות","600 גרם פטריות.","300 גרם ערמונים","1 לי טר מים או מרק ירקות","250 מל שמנת לבישול","1 כפית מלח"}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=3,
                MinutesToMake=45,
                UserCode="1"
            },
            new Recipe()
            {
                Code=23,
                Name="דג אמנון בירקות",
                Image="../../assets/am.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "4 כפות שמן זית","1 בצל גדול קצוץ","3 שיני שום כתושות","600 גרם פטריות.","300 גרם ערמונים","1 לי טר מים או מרק ירקות","250 מל שמנת לבישול","1 כפית מלח"}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=3,
                MinutesToMake=45,
                UserCode="1"
            },
             new Recipe()
            {
                Code=24,
                Name="חזה ממולא",
                Image="../../assets/sh.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "4 כפות שמן זית","1 בצל גדול קצוץ","3 שיני שום כתושות","600 גרם פטריות.","300 גרם ערמונים","1 לי טר מים או מרק ירקות","250 מל שמנת לבישול","1 כפית מלח"}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=2,
                MinutesToMake=45,
                UserCode="1"
            },
              new Recipe()
            {
                Code=25,
                Name="שיפודים",
                Image="../../assets/shi.jpg",
                Level=3,
                Ingreadients=new List<string>(new string[]{ "4 כפות שמן זית","1 בצל גדול קצוץ","3 שיני שום כתושות","600 גרם פטריות.","300 גרם ערמונים","1 לי טר מים או מרק ירקות","250 מל שמנת לבישול","1 כפית מלח"}),
                Introductions=new List<string>(new string[]{ "מקציפים חלבונים עם קורט מלח עד לקבלת קצף לבן ואוורירי.","מוסיפים בהדרגה סוכר תוך כדי הקצפה עד לקבלת קצף לבן ויציב.",
                    "בקערה נפרדת מקציפים חלמונים עם קורט מלח, עד שהתערובת מלבינה מעט ומכפילה את הנפח.","מוסיפים שמן ותמצית וניל ומערבבים.",
                    "מוסיפים בתנועות קיפול את קצף החלבונים לקערת החלמונים.","מנפים פנימה קמח ואבקת אפייה ומקפלים בעדינות עד לאיחוד.",
                    "יוצקים את בלילת הטורט לתבנית ודופקים קלות את התבנית על השיש כדי ליישר ולהוציא בועות אויר.","אופים כרבע שעה עד שהבסיס מזהיב."}),
                CategoryCode=2,
                MinutesToMake=45,
                UserCode="1"
            },
        };

        public static List<Category> Categories { get; set; } = new List<Category>()
        {
            new Category(){Code=1,Name="cakes",IconPath="../../assets/icons food/icon-cake.png"},
            new Category(){Code=2,Name="meat",IconPath="../../assets/icons food/hot.jpg"},
            new Category(){Code=3,Name="fish",IconPath="../../assets/icons food/icon-fish1.png"},
            new Category(){Code=4,Name="ice cream and desserts",IconPath="../../assets/icons food/icon-dessert.png"},
            new Category(){Code=5,Name="soups",IconPath="../../assets/icons food/icon-soup.png"}
        };

    }
}